In [1]:
import pandas as pd
dict1={"Name":["nasheena","Prasanna","Santhosh","Parvin"],"age":[15,25,18,26],"Qualification":["Degree","Btch","Inter","10th"]}

In [2]:
df=pd.DataFrame(dict1)
df

       Name  age Qualification
0  nasheena   15        Degree
1  Prasanna   25          Btch
2  Santhosh   18         Inter
3    Parvin   26          10th

In [3]:
dict2={"Name":["nasheena","Prasanna","Santhosh","Parvin"],"Localtion":["Patanpeta","Mtm","Viz","pmr"]}

In [4]:
df1=pd.DataFrame(dict2)
df1

       Name  Localtion
0  nasheena  Patanpeta
1  Prasanna        Mtm
2  Santhosh        Viz
3    Parvin        pmr

In [5]:
# ******************************append data frames ************************

In [6]:
pd.concat([df,df1],axis=0)

       Name   age Qualification  Localtion
0  nasheena  15.0        Degree        NaN
1  Prasanna  25.0          Btch        NaN
2  Santhosh  18.0         Inter        NaN
3    Parvin  26.0          10th        NaN
0  nasheena   NaN           NaN  Patanpeta
1  Prasanna   NaN           NaN        Mtm
2  Santhosh   NaN           NaN        Viz
3    Parvin   NaN           NaN        pmr

In [7]:

#                            ***********append dictonaries********method 2**********

In [8]:
# Using ** (Unpacking Operator) in Python 3.5+
append={**dict1, **dict2}
append

{'Name': ['nasheena', 'Prasanna', 'Santhosh', 'Parvin'],
 'age': [15, 25, 18, 26],
 'Qualification': ['Degree', 'Btch', 'Inter', '10th'],
 'Localtion': ['Patanpeta', 'Mtm', 'Viz', 'pmr']}

In [9]:

#                            ***********append dictonaries********method 3**********

In [10]:
 # Using | (Union Operator) in Python 3.9+
ap1=dict1 | dict2
ap1

{'Name': ['nasheena', 'Prasanna', 'Santhosh', 'Parvin'],
 'age': [15, 25, 18, 26],
 'Qualification': ['Degree', 'Btch', 'Inter', '10th'],
 'Localtion': ['Patanpeta', 'Mtm', 'Viz', 'pmr']}

In [11]:
# *********************************update*********************************

In [12]:
dict1

{'Name': ['nasheena', 'Prasanna', 'Santhosh', 'Parvin'],
 'age': [15, 25, 18, 26],
 'Qualification': ['Degree', 'Btch', 'Inter', '10th']}

In [13]:
import pandas as pd

# Update the 'age' column
dict1["age"] = [18, 31, 36, 90]

print(dict1)

{'Name': ['nasheena', 'Prasanna', 'Santhosh', 'Parvin'], 'age': [18, 31, 36, 90], 'Qualification': ['Degree', 'Btch', 'Inter', '10th']}

In [14]:
df

       Name  age Qualification
0  nasheena   15        Degree
1  Prasanna   25          Btch
2  Santhosh   18         Inter
3    Parvin   26          10th

In [15]:
# # Update 'age' where 'name' is 'Alice'
# df.loc[df["name"] == "Alice", "age"] = 27

df.loc[df["Name"] == "Jayasri","age"]= 15
df

       Name  age Qualification
0  nasheena   15        Degree
1  Prasanna   25          Btch
2  Santhosh   18         Inter
3    Parvin   26          10th

In [16]:
# ------------------Adding or Updating Multiple Columns

In [17]:
# Adding a new column 'city'
df["city"] = ["New York", "San Francisco", "Los Angeles","india"]

print(df)

       Name  age Qualification           city
0  nasheena   15        Degree       New York
1  Prasanna   25          Btch  San Francisco
2  Santhosh   18         Inter    Los Angeles
3    Parvin   26          10th          india

In [18]:
# ---------------------4. Updating Values Using apply() Function

In [19]:
# Increase the 'age' by 1 using apply
df["age"] = df["age"].apply(lambda x: x + 1)

print(df)

       Name  age Qualification           city
0  nasheena   16        Degree       New York
1  Prasanna   26          Btch  San Francisco
2  Santhosh   19         Inter    Los Angeles
3    Parvin   27          10th          india

In [20]:
df

       Name  age Qualification           city
0  nasheena   16        Degree       New York
1  Prasanna   26          Btch  San Francisco
2  Santhosh   19         Inter    Los Angeles
3    Parvin   27          10th          india

In [21]:
# Rename the columns
df.rename(columns={"Name": "full_name", "age": "years_old","city": "City_v1"}, inplace=True)

print(df)

  full_name  years_old Qualification        City_v1
0  nasheena         16        Degree       New York
1  Prasanna         26          Btch  San Francisco
2  Santhosh         19         Inter    Los Angeles
3    Parvin         27          10th          india

In [22]:
# Update 'age' where 'name' is 'Bob' and set it to 33
df.loc[df["full_name"] == "nasheena", "years_old"] = 33

print(df)

  full_name  years_old Qualification        City_v1
0  nasheena         33        Degree       New York
1  Prasanna         26          Btch  San Francisco
2  Santhosh         19         Inter    Los Angeles
3    Parvin         27          10th          india

In [23]:
df.replace({"City_v1": {"San Francisco": "SF"}}, inplace=True)

print(df)

  full_name  years_old Qualification      City_v1
0  nasheena         33        Degree     New York
1  Prasanna         26          Btch           SF
2  Santhosh         19         Inter  Los Angeles
3    Parvin         27          10th        india

In [24]:
# Set 'full_name' as the index
df.set_index("full_name", inplace=True)

print(df)

           years_old Qualification      City_v1
full_name
nasheena          33        Degree     New York
Prasanna          26          Btch           SF
Santhosh          19         Inter  Los Angeles
Parvin            27          10th        india

In [25]:
df

           years_old Qualification      City_v1
full_name
nasheena          33        Degree     New York
Prasanna          26          Btch           SF
Santhosh          19         Inter  Los Angeles
Parvin            27          10th        india

In [26]:
del df["City_v1"]

In [27]:
df

           years_old Qualification
full_name
nasheena          33        Degree
Prasanna          26          Btch
Santhosh          19         Inter
Parvin            27          10th

In [28]:
df.pop("Qualification")

full_name
nasheena    Degree
Prasanna      Btch
Santhosh     Inter
Parvin        10th
Name: Qualification, dtype: object

In [37]:
# Remove the "age" key using dictionary comprehension
df = {key: value for key, value in df.items() if key != "full_name"}

print(df)
# Output: {'name': 'David', 'city': 'Tokyo'}

{'years_old': full_name
nasheena    33
Prasanna    26
Santhosh    19
Parvin      27
Name: years_old, dtype: int64}

In [39]:
# dictonary:--
# 1.append data frames and (append dictonary using two methods)
# 2.update
# 3.update with condition
# 4.reanme
# 5.add column
# 6.set index
# 7.replace
# 8.Increase the --'age' by 1 using apply
# 9.delete